test/processed_files/invoices_1630952140/South African Gold Mines Corp.xml

<root><invoice><buyer>South African Gold Mines Corp</buyer><image_name>scanned_invoice_1.png</image_name><invoice_due_date>2020-09-01</invoice_due_date><invoice_number>AA16789-1</invoice_number><invoice_amount>22000.89</invoice_amount><invoice_currency>USD</invoice_currency><invoice_status>NEW</invoice_status><supplier>Goldie &amp; Sons</supplier></invoice><invoice><buyer>South African Gold Mines Corp</buyer><image_name>scanned_invoice_2.png</image_name><invoice_due_date>2020-09-01</invoice_due_date><invoice_number>AA16789-2</invoice_number><invoice_amount>45000.0</invoice_amount><invoice_currency>USD</invoice_currency><invoice_status>NEW</invoice_status><supplier>Goldie &amp; Sons</supplier></invoice><invoice><buyer>South African Gold Mines Corp</buyer><image_name>scanned_invoice_3.png</image_name><invoice_due_date>2020-09-01</invoice_due_date><invoice_number>AA16789-3</invoice_number><invoice_amount>30012.5</invoice_amount><invoice_currency>USD</invoice_currency><invoice_status>NEW</invoice_status><supplier>Brown Retailers</supplier></invoice><invoice><buyer>South African Gold Mines Corp</buyer><image_name>scanned_invoice_4.png</image_name><invoice_due_date>2019-12-13</invoice_due_date><invoice_number>AA16789-4</invoice_number><invoice_amount>45000.0</invoice_amount><invoice_currency>USD</invoice_currency><invoice_status /><supplier>Goldie &amp; Sons</supplier></invoice><invoice><buyer>South African Gold Mines Corp</buyer><image_name /><invoice_due_date>2019-11-13</invoice_due_date><invoice_number>AA16789-4</invoice_number><invoice_amount>45000.0</invoice_amount><invoice_currency>USD</invoice_currency><invoice_status /><supplier>Goldie &amp; Sons</supplier></invoice><invoice><buyer>South African Gold Mines Corp</buyer><image_name>scanned_invoice_6.png</image_name><invoice_due_date>2020-02-13</invoice_due_date><invoice_number>AA16789-4</invoice_number><invoice_amount>12.89</invoice_amount><invoice_currency>USD</invoice_currency><invoice_status>PAID</invoice_status><supplier>United Manufacturers</supplier></invoice></root>