test/processed_files/invoices_1630952140/Traksas.xml

<root><invoice><buyer>Traksas</buyer><image_name /><invoice_due_date>2020-09-01</invoice_due_date><invoice_number>IIPT78-65</invoice_number><invoice_amount>12400.0</invoice_amount><invoice_currency>CAD</invoice_currency><invoice_status>VOID</invoice_status><supplier>United Manufacturers</supplier></invoice><invoice><buyer>Traksas</buyer><image_name>invb.png</image_name><invoice_due_date>2020-01-01</invoice_due_date><invoice_number>PPOO90</invoice_number><invoice_amount>12400.0</invoice_amount><invoice_currency>CAD</invoice_currency><invoice_status>PAID</invoice_status><supplier>United Manufacturers</supplier></invoice><invoice><buyer>Traksas</buyer><image_name /><invoice_due_date>2020-10-23</invoice_due_date><invoice_number>PP7890U</invoice_number><invoice_amount>600.0</invoice_amount><invoice_currency>CAD</invoice_currency><invoice_status>NEW</invoice_status><supplier>United Manufacturers</supplier></invoice></root>